# Profile1OffsetX Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..Profile1OffsetX Property
ParameterTypeId Class See Also
---
"Horizontal Profile Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId Profile1OffsetX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Profile1OffsetX As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Profile1OffsetX {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace